README.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2021-05-20 Thu 16:19 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>&lrm;</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="hirano" />
</head>
<body>
<div id="content">
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org92b58da">1. Luncho: Common Value Index for the economic inequality issue</a>
<ul>
<li><a href="#org461f50f">1.1. With 100 Luncho, you can have simple lunch in every country.</a></li>
<li><a href="#orgea494a6">1.2. Who should use Luncho?</a></li>
<li><a href="#orgb63dac3">1.3. How it works?</a></li>
<li><a href="#orge3588e6">1.4. Data</a></li>
<li><a href="#org3fa1d69">1.5. Author</a></li>
<li><a href="#org2bc050d">1.6. Acknowledgment</a></li>
<li><a href="#org5b1b95c">1.7. MIT License</a></li>
</ul>
</li>
</ul>
</div>
</div>
<div id="outline-container-org92b58da" class="outline-2">
<h2 id="org92b58da"><span class="section-number-2">1</span> Luncho: Common Value Index for the economic inequality issue</h2>
<div class="outline-text-2" id="text-1">
</div>
<div id="outline-container-org461f50f" class="outline-3">
<h3 id="org461f50f"><span class="section-number-3">1.1</span> With 100 Luncho, you can have simple lunch in every country.</h3>
<div class="outline-text-3" id="text-1-1">
<p>
The main applications are <b>determining wages</b> and the <b>pricing of digital services</b>.
</p>

<p>
Suppose you are selling your digital service for $7 per month per user. That price may be good for
people living in advanced countries. But, how about for people in other countries? So many people
might feel that $7 was too expensive.
</p>

<p>
In that case you can sell your digital service at 100 Luncho per month, for example. Your site can
show both a Luncho price and its local prices using this Luncho server.
</p>

<ul class="org-ul">
<li>In USA
Product A  100 Luncho per month, $7.12 ($7.12 USD)</li>

<li>In India
Product A  100 Luncho per month, 157.51 Rupee ($2.14 USD)</li>

<li>In Finland
Product A  100 Luncho per month, 6.08 Euro ($7.35 USD)</li>

<li>In Peru
Product A  100 Luncho per month, 12.84 Sol ($3.45 USD)</li>
</ul>

<p>
It seems your revenue goes down? Maybe no because people who couldn't buy your digital service would
become to buy it. You can expect more users will utilize your service.
</p>
</div>
</div>


<div id="outline-container-orgea494a6" class="outline-3">
<h3 id="orgea494a6"><span class="section-number-3">1.2</span> Who should use Luncho?</h3>
<div class="outline-text-3" id="text-1-2">
<ul class="org-ul">
<li>Digital service providers</li>
<li>Global companies that pay wages</li>
</ul>
</div>
</div>

<div id="outline-container-orgb63dac3" class="outline-3">
<h3 id="orgb63dac3"><span class="section-number-3">1.3</span> How it works?</h3>
<div class="outline-text-3" id="text-1-3">
<p>
Luncho is calculated using <a href="https://www.worldbank.org/en/programs/icp">implied Purchase Power Parity (PPP) in the latest International
Comparison Program (ICP)</a>, <a href="https://www.imf.org/en/About/Factsheets/Sheets/2016/08/01/14/51/Special-Drawing-Right-SDR">IMF's Special Drawing Rights (SDR)</a>, and the exchange rate of every currency.
</p>

<p>
A PPP shows the price level in a country, that is, how much goods and services are in the
country. The SDR is a mixture of major currencies including US Dollar, Euro, GB Pound, Japanese Yen,
and Chinese Yuan. The SDR and exchange rates are updated every hour.
</p>

<p>
100 Luncho is 5 SDR and it's converted into local currency using the PPP.
</p>

<p>
The PPP is based on the latest International Comparison Program (ICP) lead by the World Bank. The
ICP is tremendous effort done every five years by many people that investigates price levels of <a href="https://openknowledge.worldbank.org/bitstream/handle/10986/33623/9781464815300.pdf">many
items such as bread, pork, cheese, sugar, gas, medical services, cars, etc. in all countries</a>. Luncho
uses Actual Individual Consumption (AIC) per capita that represents statistical price levels in
daily lives for wide applications, not actual lunch prices.
</p>

<p>
Thus, with 100 Luncho in a country, you can expect to have simple lunch in a restaurant for local
residents. Caution that restaurant for tourists should be much more expensive actually.
</p>

<p>
It's similar to <a href="https://www.economist.com/big-mac-index">Big Mac index</a>, but considers much more factors.
</p>
</div>
</div>


<div id="outline-container-orge3588e6" class="outline-3">
<h3 id="orge3588e6"><span class="section-number-3">1.4</span> Data</h3>
<div class="outline-text-3" id="text-1-4">
<ul class="org-ul">
<li>PPP from IMF World Economic Outlook (October 2020)
<ul class="org-ul">
<li>data/imf-dm-export-20201110.csv</li>
<li>Press "All Data" to get it at <a href="https://www.imf.org/external/datamapper/PPPEX@WEO/OEMDC/ADVEC/WEOWORLD">here</a></li>
<li>194 countries and regions</li>
<li>Country name is defined as "Table Name" in the following ICP-2017 metadata</li>
</ul></li>

<li>ICP-2017 metadata
<ul class="org-ul">
<li>data/Data<sub>Extract</sub><sub>From</sub><sub>ICP</sub><sub>2017</sub><sub>Metadata.csv</sub></li>
<li>Extracted the following metadata from <a href="https://databank.worldbank.org/source/icp-2017?preview=on">ICP-2017 database</a></li>
<li>Code,Long Name,Currency Unit,Table Name,Household consumption price survey: Geographical coverage</li>
<li><p>
Examples
</p>

<p>
AFG,Islamic State of Afghanistan,AFN: Afghani,Afghanistan,
ALB,Republic of Albania,ALL: Lek,Albania,Urban only
DZA,People's Democratic Republic of Algeria,DZD: Algerian Dinar,Algeria,Urban and Rural
</p></li>
</ul></li>

<li>ICP-2017 Purchasing power parity (PPP) (US$ = 1)
<ul class="org-ul">
<li>Extracted the following from <a href="https://databank.worldbank.org/source/icp-2017?preview=on">ICP-2017 database</a>
<ul class="org-ul">
<li>Actual Individual Consumption (AIC) per capita</li>
</ul></li>
</ul></li>
</ul>
</div>
</div>

<div id="outline-container-org3fa1d69" class="outline-3">
<h3 id="org3fa1d69"><span class="section-number-3">1.5</span> Author</h3>
<div class="outline-text-3" id="text-1-5">
<p>
Dr HIRANO Satoshi, AIST
</p>
</div>
</div>

<div id="outline-container-org2bc050d" class="outline-3">
<h3 id="org2bc050d"><span class="section-number-3">1.6</span> Acknowledgment</h3>
<div class="outline-text-3" id="text-1-6">
<ul class="org-ul">
<li>Many people who worked hard for the International Comparison Program</li>
<li>The Aurelia core team for Aurelia framework</li>
<li>MaterializeCSS and Aurelia Materialize Bridge for CSS</li>
<li>Starlette, Pydantic, and FastAPI for Web framework</li>
<li>SQLAlchemy for database access</li>
<li>OpenAPI for generating client libraries</li>
<li>Fixer.io for exchange rates</li>
<li>AIST and Human Informatics and Interaction Research Institute (HIIRI) for support</li>
</ul>
</div>
</div>

<div id="outline-container-org5b1b95c" class="outline-3">
<h3 id="org5b1b95c"><span class="section-number-3">1.7</span> MIT License</h3>
<div class="outline-text-3" id="text-1-7">
<p>
Copyright 2019-2021 The National Institute of Advanced Industrial Science and Technology (AIST), Japan
</p>

<p>
Permission is hereby granted, free of charge, to any person obtaining a copy of this software and associated documentation files (the "Software"), to deal in the Software without restriction, including without limitation the rights to use, copy, modify, merge, publish, distribute, sublicense, and/or sell copies of the Software, and to permit persons to whom the Software is furnished to do so, subject to the following conditions:
</p>

<p>
The above copyright notice and this permission notice shall be included in all copies or substantial portions of the Software.
</p>

<p>
THE SOFTWARE IS PROVIDED "AS IS", WITHOUT WARRANTY OF ANY KIND, EXPRESS OR IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF MERCHANTABILITY, FITNESS FOR A PARTICULAR PURPOSE AND NONINFRINGEMENT. IN NO EVENT SHALL THE AUTHORS OR COPYRIGHT HOLDERS BE LIABLE FOR ANY CLAIM, DAMAGES OR OTHER LIABILITY, WHETHER IN AN ACTION OF CONTRACT, TORT OR OTHERWISE, ARISING FROM, OUT OF OR IN CONNECTION WITH THE SOFTWARE OR THE USE OR OTHER DEALINGS IN THE SOFTWARE.
</p>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: hirano</p>
<p class="date">Created: 2021-05-20 Thu 16:19</p>
<p class="validation"><a href="https://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
